package ch04;

public class Test01 {

	public static void main(String[] args) {
		사람 a1 = new 사람();
		사람 a2 = new 사람();
		사람 a3 = new 사람();
		///////////////////////////
		a1.이름 = "최승의";
		a1.직업 = "의사";
		a1.나이 = 45;
		a1.성별 = false;//여자
		a1.혈액형= "A";
		//////////////////////////
		a2.이름 = "이미녀";
		a2.직업 = "골프선수";
		a2.나이 = 28;
		a2.성별 = false;//여자
		a2.혈액형= "O";
		/////////////////////////
		a3.이름 = "김미남";
		a3.직업 = "교수";
		a3.나이 = 47;
		a3.성별 = true;//남자
		a3.혈액형= "AB"; 
		//////////////////////////
 		System.out.println(a1.이름+","+a1.직업+","+a1.나이+","+a1.성별+","+a1.혈액형); //@279f2327 주소값
		System.out.println(a2.이름+","+a2.직업+","+a2.나이+","+a2.성별+","+a2.혈액형); //@2ff4acd0 
		System.out.println(a3.이름+","+a3.직업+","+a3.나이+","+a3.성별+","+a3.혈액형); //@54bedef2
	}

}
